Optimization Procedure/Analyzing Results.org
* Analyzing Results

When backtesting indicators or indicator sets there is a significant likelihood
of [[https://en.wikipedia.org/wiki/Curve_fitting][curve fitting]] which gives good results for the specific backtested period but
would not give good results in forward testing. This is also called
over-optimization.

** Filtering Over-Optimization
   :PROPERTIES:
   :CUSTOM_ID: filtering-over-optimization
   :END:

[[file:Parameter Optimization.org][Parameter Optimization]] describes that if the value of a [[file:~/work/backtestd-doc/Algorithm Components/Input Parameters.org::#continuous-input][Continuous Input]] changes,
the result value must change proportionally to the input change.

*** Assumtion:
based on [[file:Parameter Optimization.org][Parameter Optimization]]

If the value of a continuous input changes by a single step but the result
changes significantly, the results can be considered random and must be filtered.

/What is significant?/
